app/controllers/events_controller.rb

	def edit
		@event = Event.find(params[:id])
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1

	def show
		@event = Event.find(params[:id])
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1

	def create
		@event = Event.new(event_params)
		if @event.save
---
INSERT INTO `events` (`eventName`, `location`, `description`, `facebookLink`, `startTime`, `startDay`, `endTime`, `endDay`, `created_at`, `updated_at`) VALUES ('Daichi\'s Party', '2760 Park Avenue', 'Roboterra Party', 'roboterra.com', '2016-06-24 03:00:00', '2016-06-26 05:00:00', '2016-06-23 06:00:00', '2016-06-27 05:00:00', '2016-06-23 06:13:22', '2016-06-23 06:13:22')

	def update
		@event = Event.find(params[:id])
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1

	def destroy
		@event = Event.find(params[:id])
		@event.destroy
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1
DELETE FROM `events` WHERE `events`.`id` = 1